# PANDAS: DATA MANIPULATION

In [3]:
a = {"Days": ['sun','mon','tues','wed','thurs','fri','sat'], "study_hrs": [1,2,1,3,2,3,2], "game_hrs": [1,2,1,2,3,2,1]}
print(a)

{'Days': ['sun', 'mon', 'tues', 'wed', 'thurs', 'fri', 'sat'], 'study_hrs': [1, 2, 1, 3, 2, 3, 2], 'game_hrs': [1, 2, 1, 2, 3, 2, 1]}

In [4]:
import pandas as pd
s = pd.Series(a)
print(s)

Days         [sun, mon, tues, wed, thurs, fri, sat]
study_hrs                     [1, 2, 1, 3, 2, 3, 2]
game_hrs                      [1, 2, 1, 2, 3, 2, 1]
dtype: object

In [5]:
s.Days

['sun', 'mon', 'tues', 'wed', 'thurs', 'fri', 'sat']

In [6]:
s[1]

[1, 2, 1, 3, 2, 3, 2]

# DATA FRAMES

In [7]:
df= pd.DataFrame(a)
df

    Days  study_hrs  game_hrs
0    sun          1         1
1    mon          2         2
2   tues          1         1
3    wed          3         2
4  thurs          2         3
5    fri          3         2
6    sat          2         1

In [8]:
df.describe()

       study_hrs  game_hrs
count   7.000000  7.000000
mean    2.000000  1.714286
std     0.816497  0.755929
min     1.000000  1.000000
25%     1.500000  1.000000
50%     2.000000  2.000000
75%     2.500000  2.000000
max     3.000000  3.000000

In [9]:
df.head()

    Days  study_hrs  game_hrs
0    sun          1         1
1    mon          2         2
2   tues          1         1
3    wed          3         2
4  thurs          2         3

In [13]:
file = pd.read_csv(r"F:\DOCUMENTS\RISHIKA\Datasets\Datasets\crop_production.csv")
file.head()

,State_Name,District_Name,Crop_Year,Season,Crop,Area,Production
0,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Arecanut,1254.0,2000.0
1,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Other Kharif pulses,2.0,1.0
2,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Rice,102.0,321.0
3,Andaman and Nicobar Islands,NICOBARS,2000,Whole Year,Banana,176.0,641.0
4,Andaman and Nicobar Islands,NICOBARS,2000,Whole Year,Cashewnut,720.0,165.0